# STEP 6: Repeat the computation from the facts & dimension table

Note: You will not have to write any code in this notebook. It's purely to illustrate the performance difference between Star and 3NF schemas.

Start by running the code in the cell below to connect to the database.

In [13]:
#!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
#!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
#!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

In [15]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://student:student@127.0.0.1:5432/pagila

'Connected: student@pagila'

## 6.1 Facts Table has all the needed dimensions, no need for deep joins

In [16]:
%%time
%%sql
SELECT *
FROM factSales 
limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
5 rows affected.
CPU times: user 2.6 ms, sys: 0 ns, total: 2.6 ms
Wall time: 6.06 ms

[(16050, 20170124, 269, 870, 2, Decimal('1.99')),
 (16051, 20170125, 269, 651, 1, Decimal('0.99')),
 (16052, 20170128, 269, 818, 1, Decimal('6.99')),
 (16053, 20170129, 269, 249, 2, Decimal('0.99')),
 (16054, 20170129, 269, 159, 2, Decimal('4.99'))]

## 6.2 Join fact table with dimensions to replace keys with attributes

As you run each cell, pay attention to the time that is printed. Which schema do you think will run faster?

##### Star Schema

In [23]:
%%time
%%sql
SELECT dimMovie.title, dimDate.month, dimCustomer.city, sum(sales_ammount) as revenue
FROM factSales 
JOIN dimMovie    on (dimMovie.movie_key      = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
group by (dimMovie.title, dimDate.month, dimCustomer.city)
order by dimMovie.title, dimDate.month, dimCustomer.city, revenue desc limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
5 rows affected.
CPU times: user 4.89 ms, sys: 0 ns, total: 4.89 ms
Wall time: 49.9 ms

[('ACADEMY DINOSAUR', 1, 'Celaya', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 1, 'Cianjur', Decimal('1.99')),
 ('ACADEMY DINOSAUR', 2, 'San Lorenzo', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 2, 'Sullana', Decimal('1.99')),
 ('ACADEMY DINOSAUR', 2, 'Udaipur', Decimal('0.99'))]

##### 3NF Schema

In [24]:
%%time
%%sql
SELECT f.title, EXTRACT(month FROM p.payment_date) as month, ci.city, sum(p.amount) as revenue
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by (f.title, month, ci.city)
order by f.title, month, ci.city, revenue desc limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
5 rows affected.
CPU times: user 6.54 ms, sys: 0 ns, total: 6.54 ms
Wall time: 106 ms

[('ACADEMY DINOSAUR', 1.0, 'Celaya', Decimal('1.98')),
 ('ACADEMY DINOSAUR', 1.0, 'Cianjur', Decimal('3.98')),
 ('ACADEMY DINOSAUR', 2.0, 'San Lorenzo', Decimal('1.98')),
 ('ACADEMY DINOSAUR', 2.0, 'Sullana', Decimal('3.98')),
 ('ACADEMY DINOSAUR', 2.0, 'Udaipur', Decimal('1.98'))]

# Conclusion

We were able to show that:
* The star schema is easier to understand and write queries against.
* Queries with a star schema are more performant.